#correct_password = '12345'
#password = input('Введите пароль: ')
# если пароль верный
#if password == correct_password:
#    print('Авторизация прошла успешно')
# если пароль неверный
#else:
#    print('Введен неверный пароль')

# считываем число
#number = int(input('Введите число: '))
# если число больше нуля
#if number > 0:
#    print('Число положительное')
# в противном случае, если число меньше нуля
#elif number < 0:
#    print('Число отрицательное')
# в противном случае
#else:
#    print('Число равно 0')


# считываем число
#number = int(input('Введите число: '))
# если число делится на 2 без остатка
#if number % 2 == 0:
#    print('Число четное')
#elif number == "1":
#    print('Число нечетное')
#если число не делится на 2 без остатка
#else:
#    print('Число нечетное')

# OR
# считываем число
#number = int(input('Введите число больше или равное нулю: '))
# если число больше нуля или число равно нулю
#if number > 0 or number == 0:
#    print('Число больше или равно нуля')
# в противном случае число отрицательное
#else:
#    print('Число отрицательное')

# AND
#correct_password = '12345'
#correct_login = 'user777'
# считываем логи и пароль
#login = input('Введите логин: ')
#password = input('Введите пароль: ')
# если логин и пароль верный
#if login == correct_login and password == correct_password:
#    print('Авторизация прошла успешно')
# если логин или пароль неверный
#else:
#    print('Введен неверный логин или пароль')

#Операторы сравнения
#a = 10
#b = 0
#c = 10

#print(a == b)  # False - a не равно b
#print(a != b)  # True - a не равно b
#print(a > b)  # True - a больше b
#print(a < b)  # False - a больше b
#print(a >= c)  # True - a равно c
#print(c <= b)  # False - c больше b